clear
clc 
% 多直方图(代码)
x0=[0.1,0.2,0.3,0.4,0.5];
psnr0=[48.5972,48.8220,45.6662,44.5186,42.5363];
% 多直方图（论文数据）
x1=[0.1,0.2,0.3,0.4,0.5];
psnr1=[56.0,51.5,48.0,45.7,43.5];
% 多直方图（论文参数）
x2=[0.1,0.2,0.3,0.4,0.5];
psnr2=[51.4054,50.2185,47.9789,44.5151,43.6876];

figure;
plot(x0(1,:),psnr0(1,:),'r-o'); %红色
hold on;
plot(x1(1,:),psnr1(1,:),'k-x'); %黑色
hold on;
plot(x2(1,:),psnr2(1,:),'b-*'); %蓝色
legend('代码数据','论文数据','论文参数');
title('Lena图像的PSNR值比较');
xlabel('数据嵌入量（单位：bpp）','LineWidth',14);
ylabel('PSNR(dB)','LineWidth',14);